{"keras_version": "1.2.1", "config": {"output_layers": [["Steering_Angle", 0, 0]], "layers": [{"config": {"input_dtype": "float32", "sparse": false, "batch_input_shape": [null, 64, 64, 3], "name": "input_1"}, "inbound_nodes": [], "name": "input_1", "class_name": "InputLayer"}, {"config": {"function": ["\u00e3\u0001\u0000\u0000\u0000\u0000\u0000\u0000\u0000\u0001\u0000\u0000\u0000\u0002\u0000\u0000\u0000S\u0000\u0000\u0000s\f\u0000\u0000\u0000|\u0000\u0000d\u0001\u0000\u001bd\u0002\u0000\u0018S)\u0003N\u00e7\u0000\u0000\u0000\u0000\u0000\u00e0o@\u00e7\u0000\u0000\u0000\u0000\u0000\u0000\u00e0?\u00a9\u0000)\u0001\u00da\u0001xr\u0003\u0000\u0000\u0000r\u0003\u0000\u0000\u0000\u00fa\rmodel_uda2.py\u00da\b<lambda>}\u0000\u0000\u0000s\u0000\u0000\u0000\u0000", null, null], "output_shape": null, "name": "lambda_1", "function_type": "lambda", "trainable": true, "arguments": {}, "output_shape_type": "raw"}, "inbound_nodes": [[["input_1", 0, 0]]], "name": "lambda_1", "class_name": "Lambda"}, {"config": {"init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "bias": true, "dim_ordering": "tf", "nb_col": 3, "nb_row": 3, "activation": "linear", "b_regularizer": null, "b_constraint": null, "name": "convolution2d_1", "nb_filter": 12, "trainable": true, "W_regularizer": null}, "inbound_nodes": [[["lambda_1", 0, 0]]], "name": "convolution2d_1", "class_name": "Convolution2D"}, {"config": {"epsilon": 0.001, "axis": 1, "mode": 0, "name": "batchnormalization_1", "trainable": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution2d_1", 0, 0]]], "name": "batchnormalization_1", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_1"}, "inbound_nodes": [[["batchnormalization_1", 0, 0]]], "name": "elu_1", "class_name": "ELU"}, {"config": {"init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "bias": true, "dim_ordering": "tf", "nb_col": 3, "nb_row": 3, "activation": "linear", "b_regularizer": null, "b_constraint": null, "name": "convolution2d_2", "nb_filter": 32, "trainable": true, "W_regularizer": null}, "inbound_nodes": [[["elu_1", 0, 0]]], "name": "convolution2d_2", "class_name": "Convolution2D"}, {"config": {"epsilon": 0.001, "axis": 1, "mode": 0, "name": "batchnormalization_2", "trainable": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution2d_2", 0, 0]]], "name": "batchnormalization_2", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_2"}, "inbound_nodes": [[["batchnormalization_2", 0, 0]]], "name": "elu_2", "class_name": "ELU"}, {"config": {"strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_1", "trainable": true, "pool_size": [3, 3], "dim_ordering": "tf"}, "inbound_nodes": [[["elu_2", 0, 0]]], "name": "maxpooling2d_1", "class_name": "MaxPooling2D"}, {"config": {"init": "glorot_uniform", "W_constraint": null, "activity_regularizer": null, "border_mode": "valid", "subsample": [1, 1], "bias": true, "dim_ordering": "tf", "nb_col": 3, "nb_row": 3, "activation": "linear", "b_regularizer": null, "b_constraint": null, "name": "convolution2d_3", "nb_filter": 64, "trainable": true, "W_regularizer": null}, "inbound_nodes": [[["maxpooling2d_1", 0, 0]]], "name": "convolution2d_3", "class_name": "Convolution2D"}, {"config": {"epsilon": 0.001, "axis": 1, "mode": 0, "name": "batchnormalization_3", "trainable": true, "gamma_regularizer": null, "beta_regularizer": null, "momentum": 0.99}, "inbound_nodes": [[["convolution2d_3", 0, 0]]], "name": "batchnormalization_3", "class_name": "BatchNormalization"}, {"config": {"trainable": true, "alpha": 1.0, "name": "elu_3"}, "inbound_nodes": [[["batchnormalization_3", 0, 0]]], "name": "elu_3", "class_name": "ELU"}, {"config": {"strides": [2, 2], "border_mode": "valid", "name": "maxpooling2d_2", "trainable": true, "pool_size": [3, 3], "dim_ordering": "tf"}, "inbound_nodes": [[["elu_3", 0, 0]]], "name": "maxpooling2d_2", "class_name": "MaxPooling2D"}, {"config": {"trainable": true, "name": "dropout_1", "p": 0.2}, "inbound_nodes": [[["maxpooling2d_2", 0, 0]]], "name": "dropout_1", "class_name": "Dropout"}, {"config": {"trainable": true, "name": "flatten_1"}, "inbound_nodes": [[["dropout_1", 0, 0]]], "name": "flatten_1", "class_name": "Flatten"}, {"config": {"init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "trainable": true, "input_dim": 10816, "output_dim": 300, "W_constraint": null, "b_regularizer": null, "b_constraint": null, "name": "dense_1", "bias": true, "W_regularizer": null}, "inbound_nodes": [[["flatten_1", 0, 0]]], "name": "dense_1", "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_1"}, "inbound_nodes": [[["dense_1", 0, 0]]], "name": "activation_1", "class_name": "Activation"}, {"config": {"trainable": true, "name": "dropout_2", "p": 0.2}, "inbound_nodes": [[["activation_1", 0, 0]]], "name": "dropout_2", "class_name": "Dropout"}, {"config": {"init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "trainable": true, "input_dim": 300, "output_dim": 60, "W_constraint": null, "b_regularizer": null, "b_constraint": null, "name": "dense_2", "bias": true, "W_regularizer": null}, "inbound_nodes": [[["dropout_2", 0, 0]]], "name": "dense_2", "class_name": "Dense"}, {"config": {"activation": "relu", "trainable": true, "name": "activation_2"}, "inbound_nodes": [[["dense_2", 0, 0]]], "name": "activation_2", "class_name": "Activation"}, {"config": {"init": "glorot_uniform", "activation": "linear", "activity_regularizer": null, "trainable": true, "input_dim": 60, "output_dim": 1, "W_constraint": null, "b_regularizer": null, "b_constraint": null, "name": "Steering_Angle", "bias": true, "W_regularizer": null}, "inbound_nodes": [[["activation_2", 0, 0]]], "name": "Steering_Angle", "class_name": "Dense"}], "input_layers": [["input_1", 0, 0]], "name": "model_1"}, "class_name": "Model"}